@DavidGOrtega, let's merge with GitLab failing; it's because of the very bug we're trying to fix.

<details><summary>Full logs, in human–readable format</summary>
```console
terraform -chdir='/home/runner' apply -auto-approve

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # iterative_cml_runner.runner will be created
  + resource "iterative_cml_runner" "runner" {
      + cloud                = "aws"
      + driver               = "gitlab"
      + id                   = (known after apply)
      + idle_timeout         = 300
      + image                = (known after apply)
      + instance_hdd_size    = 35
      + instance_ip          = (known after apply)
      + instance_launch_time = (known after apply)
      + instance_type        = "g2.2xlarge"
      + labels               = "cml-runner-gpu"
      + name                 = "cml-i9ewsgvkm1"
      + region               = "us-west"
      + repo                 = "https://gitlab.com/iterative.ai/cml"
      + single               = false
      + spot                 = true
      + spot_price           = -1
      + ssh_public           = (known after apply)
      + token                = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
iterative_cml_runner.runner: Creating...
iterative_cml_runner.runner: Still creating... [10s elapsed]
iterative_cml_runner.runner: Still creating... [20s elapsed]
iterative_cml_runner.runner: Still creating... [30s elapsed]
iterative_cml_runner.runner: Still creating... [40s elapsed]
iterative_cml_runner.runner: Still creating... [50s elapsed]
iterative_cml_runner.runner: Still creating... [1m0s elapsed]
iterative_cml_runner.runner: Still creating... [1m10s elapsed]
iterative_cml_runner.runner: Still creating... [1m20s elapsed]
iterative_cml_runner.runner: Still creating... [1m30s elapsed]
iterative_cml_runner.runner: Still creating... [1m40s elapsed]
iterative_cml_runner.runner: Still creating... [1m50s elapsed]
iterative_cml_runner.runner: Still creating... [2m0s elapsed]
iterative_cml_runner.runner: Still creating... [2m10s elapsed]
iterative_cml_runner.runner: Still creating... [2m20s elapsed]
iterative_cml_runner.runner: Still creating... [2m30s elapsed]
iterative_cml_runner.runner: Still creating... [2m40s elapsed]
iterative_cml_runner.runner: Still creating... [2m50s elapsed]
iterative_cml_runner.runner: Still creating... [3m0s elapsed]
iterative_cml_runner.runner: Still creating... [3m10s elapsed]
iterative_cml_runner.runner: Still creating... [3m20s elapsed]
iterative_cml_runner.runner: Still creating... [3m30s elapsed]
iterative_cml_runner.runner: Still creating... [3m40s elapsed]
iterative_cml_runner.runner: Still creating... [3m50s elapsed]
iterative_cml_runner.runner: Still creating... [4m0s elapsed]
iterative_cml_runner.runner: Still creating... [4m10s elapsed]
iterative_cml_runner.runner: Still creating... [4m20s elapsed]
iterative_cml_runner.runner: Still creating... [4m30s elapsed]
iterative_cml_runner.runner: Still creating... [4m40s elapsed]
iterative_cml_runner.runner: Still creating... [4m50s elapsed]
iterative_cml_runner.runner: Still creating... [5m0s elapsed]
iterative_cml_runner.runner: Still creating... [5m10s elapsed]
iterative_cml_runner.runner: Still creating... [5m20s elapsed]
iterative_cml_runner.runner: Still creating... [5m30s elapsed]
iterative_cml_runner.runner: Still creating... [5m40s elapsed]
iterative_cml_runner.runner: Still creating... [5m50s elapsed]
iterative_cml_runner.runner: Still creating... [6m0s elapsed]
iterative_cml_runner.runner: Still creating... [6m10s elapsed]
iterative_cml_runner.runner: Still creating... [6m20s elapsed]
iterative_cml_runner.runner: Still creating... [6m30s elapsed]
iterative_cml_runner.runner: Still creating... [6m40s elapsed]
iterative_cml_runner.runner: Still creating... [6m50s elapsed]
iterative_cml_runner.runner: Still creating... [7m0s elapsed]
iterative_cml_runner.runner: Still creating... [7m10s elapsed]
iterative_cml_runner.runner: Still creating... [7m20s elapsed]
iterative_cml_runner.runner: Still creating... [7m30s elapsed]
iterative_cml_runner.runner: Still creating... [7m40s elapsed]
iterative_cml_runner.runner: Still creating... [7m50s elapsed]
iterative_cml_runner.runner: Still creating... [8m0s elapsed]
iterative_cml_runner.runner: Still creating... [8m10s elapsed]
iterative_cml_runner.runner: Still creating... [8m20s elapsed]
iterative_cml_runner.runner: Still creating... [8m30s elapsed]
iterative_cml_runner.runner: Still creating... [8m40s elapsed]
iterative_cml_runner.runner: Still creating... [8m50s elapsed]
iterative_cml_runner.runner: Still creating... [9m0s elapsed]
iterative_cml_runner.runner: Still creating... [9m10s elapsed]
iterative_cml_runner.runner: Still creating... [9m20s elapsed]
iterative_cml_runner.runner: Still creating... [9m30s elapsed]
iterative_cml_runner.runner: Still creating... [9m40s elapsed]
iterative_cml_runner.runner: Still creating... [9m50s elapsed]
iterative_cml_runner.runner: Still creating... [10m0s elapsed]
iterative_cml_runner.runner: Still creating... [10m10s elapsed]
iterative_cml_runner.runner: Still creating... [10m20s elapsed]

	╷
│ Error: Error checking the runner status
│
│   with iterative_cml_runner.runner,
│   on main.tf line 14, in resource "iterative_cml_runner" "runner":
│   14: resource "iterative_cml_runner" "runner" {
│
│ -- Logs begin at Thu 2021-09-30 13:32:55 UTC, end at Sat 2021-10-16
│ 18:36:08 UTC. --
│ Oct 16 18:26:55 ip-172-31-22-93 systemd[1]: Started cml.service.
│ Oct 16 18:26:56 ip-172-31-22-93 cml.sh[3125]:
│ {"level":"error","message":"Cannot read property 'map' of
│ undefined","name":"YError","stack":"YError: Cannot read property 'map' of
│ undefined\n    at
│ /usr/lib/node_modules/@dvcorg/cml/node_modules/yargs/build/index.cjs:1:29913\n
│ at j
│ (/usr/lib/node_modules/@dvcorg/cml/node_modules/yargs/build/index.cjs:1:4952)\n
│ at
│ /usr/lib/node_modules/@dvcorg/cml/node_modules/yargs/build/index.cjs:1:29809\n
│ at
│ /usr/lib/node_modules/@dvcorg/cml/node_modules/yargs/build/index.cjs:1:4753\n
│ at Array.reduce (<anonymous>)\n    at C
│ (/usr/lib/node_modules/@dvcorg/cml/node_modules/yargs/build/index.cjs:1:4551)\n
│ at M.applyMiddlewareAndGetResult
│ (/usr/lib/node_modules/@dvcorg/cml/node_modules/yargs/build/index.cjs:1:8688)\n
│ at M.runCommand
│ (/usr/lib/node_modules/@dvcorg/cml/node_modules/yargs/build/index.cjs:1:7206)\n
│ at Jt.[runYargsParserAndExecuteCommands]
│ (/usr/lib/node_modules/@dvcorg/cml/node_modules/yargs/build/index.cjs:1:55967)\n
│ at Jt.parse
│ (/usr/lib/node_modules/@dvcorg/cml/node_modules/yargs/build/index.cjs:1:38220)\n
│ at Object.<anonymous> (/usr/lib/node_modules/@dvcorg/cml/bin/cml.js:90:4)\n
│ at Module._compile (internal/modules/cjs/loader.js:999:30)\n    at
│ Object.Module._extensions..js (internal/modules/cjs/loader.js:1027:10)\n
│ at Module.load (internal/modules/cjs/loader.js:863:32)\n    at
│ Function.Module._load (internal/modules/cjs/loader.js:708:14)\n    at
│ Function.executeUserEntryPoint [as runMain]
│ (internal/modules/run_main.js:60:12)"}
│ Oct 16 18:26:56 ip-172-31-22-93 systemd[1]: cml.service: Main process
│ exited, code=exited, status=1/FAILURE
│ Oct 16 18:26:56 ip-172-31-22-93 systemd[1]: cml.service: Failed with result
│ 'exit-code'.
│
╵

waiting 20 seconds before exiting...
```
</details>